const SelfInfo = () => {
  return (
    <>
      <div>
        【學習背景】在大學時期，我嘗試了不同領域的專業，在課餘時間自學了JAVA、HTML、PYTHON等程式語言以及日語，希望能夠利用課餘時間所學到的技能和知識，在日後的生活和工作中有所活用，使自己的競爭力不斷提升。此外，我還擔任過專題製作企劃的領導以及大學畢業會的副會長和企劃，這些經歷增強了我的領導能力，讓我學到瞭如何管理人員和規劃完成時間表。
        <br />
        <br />
        【興趣與特長】在閒暇時間，我喜歡觀看直播和玩遊戲，還曾經做過直播，讓我熟練使用了直播工具。我平時也會關注科技新知，對於電腦、手機等3C產品及資訊軟體都非常感興趣，雖然不到專業，但對相關的技術規格和產品有基礎以上的了解。
        <br />
        <br />
        【活動經驗】在我大四時期，我曾擔任本組專題的企劃，通過這次經歷，我學到了如何分工合作、領導團隊以及如何規劃工作進度。我明白了安排合理的時程對提高項目質量的重要性。
        在擔任畢業典禮的副會長和策劃之後，我積累了豐富的組織能力。我更熟練地安排分工和時間，並且在一次跨部門的策劃中，我學會了與不同部門有效溝通。
        在畢業後的待業期間，我不斷努力提升自我，拓展知識領域和實踐經驗。去年我參加了行銷相關的培訓課程，在課程中學習到了行銷相關知識。通過與社會人士的共事經驗，此次的專題更具系統及規模，從規劃、執行到行銷及UI建置，這次經歷為我的職業道路提供了很好的經驗。
        <br />
        <br />
        【工作經歷】在畢業後，我開始嘗試探索各種讓我感興趣的領域，包括企劃、UI/UX設計和網頁前端技能。透過不斷地學習和實踐，我努力吸收更深入的知識。然而，去年我意識到自己不太適應視覺和美術產業的環境，因此我果斷決定轉向網頁前端的領域。為了度過這段轉換期，我找到了一份服務業的工作，為自己的學習過程提供了一個支撐。
        <br />
        <br />
        【前端工程師】第一次從練習投入到正式的網站，學習到了很多的技能跟觀念，最重要的是串接API的技能，在課程中的API都是寫好的，所以第一次與後端溝通，去討論API的規格，其中也學到了很多寫法，像是利用switch、case的方式，去處理相同表格的不同資料，例如後端平台的中英文版資料，因為專案的內容，學到了next框架的小技巧，也知道了很多不同的插件，第三方的oauth登入實作，讓我知道了各種第三方的驗證流程，包括FB、Google、Apple的驗證流程，成長了很多。
        <br />
        <br />
        【學習歷程】在一開始，我只是個對HTML和CSS有些皮毛認識的人。考慮了各種因素後，我決定在Udemy上購買了一套英文的React課程。對於各種環境和語法的陌生，讓我的學習過程相當艱辛。在許多情況下，我無法理解老師在建構課程內容時的意圖和思路，尤其是需要將影片中的內容翻譯成中文，這讓學習過程倍感費力。經過半年的努力，我終於掌握了Hook的各種用法、API串接、Tailwind
        CSS、React生命週期等重要概念，以及常見的程式邏輯。這些知識使我逐漸熟練起來，當看到相關的元件和網頁結構時，我能夠有一些想法。雖然在許多方面還不夠深入，但我已經不再感到手足無措，這讓我更有信心面對前端開發的挑戰。
        <br />
        <br />
        【總結】經過一段時間的學習歷程和豐富的實踐經驗，我深信自己已經做好準備，迎接新的挑戰。在這過去的一年中，我積極拓展了自己的知識領域，並通過實踐不斷提升自己的技能。從自學程式語言到參與各種實踐項目，我不斷挑戰自己並取得了成長。現在，我已經準備好投身於新的工作環境，並帶著學習和成長的精神，勇敢地邁向未來。
      </div>
    </>
  );
};

export default SelfInfo;
